# HostVolumeComputed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..HostVolumeComputed Property
ParameterTypeId Class See Also
---
"Volume"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId HostVolumeComputed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostVolumeComputed As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HostVolumeComputed {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace